public class Main {
    public static void main(String[] args) {
        //Задание один 1
        System.out.println("Задание 1");
        int yearsOld = 23;
        if (yearsOld >= 18) ;
        {
            System.out.println("Поздравляем вас с совершеннолетием");
        }
        if (yearsOld < 18) ;
        {
            System.out.println("Возраст совершеннолетия еще не наступил,нужно еще подождать");
        }

        //Задание 2
        System.out.println("Задание 2");
        if (yearsOld >= 7 && yearsOld < 18) ;
        {
            System.out.println("Ребенок ходит в школу");
        }
    }}





















